/************************
* Автор: Полянчиков А.Е. *
* Название: Линейные алгоритмы *
* Вариант: 9 *
*************************/
#include <iostream>
#include <cmath>

using namespace std;

int main(){
    float L=15.4, PI=3.141592653589793, u=2.4e-4, p=0.721e4, R0=8.16, R1=8.16, R2=2.64, a=8.16, Q1, Q2, Q3;
    cout<<"Жидкость с вязкостью "<<u<<" Па*с подается под избыточным давлением P= "<<p<<" Па по трубе, имеющей длину L= "<<L<<" м."<<endl<<"Определить расход жидкости для трубы, имеющей:"<<endl;
    cout<<"а) круглое сечение "<<R0<<" см"<<endl;
    Q1=((PI*pow(R0,4))/8)*(p/(u*L));
    cout<<"Расход жидкости в трубе = "<<Q1<<endl<<endl;
    cout<<"б) кольцевое сечение "<<R1<<" см"<<endl;
    Q2=(PI/8)*(p/(u*L))*(((pow(pow(R1,2)-pow(R2,2),2))/(log(R2/R1)))+pow(R1,4)-pow(R2,4));
    cout<<"Расход жидкости в трубе = "<<Q2<<endl<<endl;
    cout<<"в) треугольное сечение "<<a<<" см"<<endl;
    Q3=((pow(a,4)*sqrt(3))/320)*(p/(u*L));
    cout<<"Расход жидкости в трубе = "<<Q3<<endl;
    return 0;
}